
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументыРеализаций(Период) Экспорт
// Начало Володин А.А. 
// Дипломная работа
// 24 февраля 2025 г.
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ДоговорыКонтрагентов.Ссылка КАК Ссылка,
        |    ДоговорыКонтрагентов.Представление КАК Представление
        |ИЗ
        |    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |ГДЕ
        |    ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
        |    И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора >= &ПериодНачало
        |    ИЛИ ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора <= &ПериодКонец";
    
    Запрос.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
    Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    //Сч = 0;
    //Количество = 100;
    
    Пока Выборка.Следующий() Цикл
        
        //Сч = Сч + 1;
        
        //ДлительныеОперации.СообщитьПрогресс(Цел(Сч / Количество * 100), "Выполняется длительная операция...");
        
    КонецЦикла;
       
    //ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
    
    Возврат "Функционал в разработке";
    
// Конец 24 февраля 2025 г.     
КонецФункции

#КонецОбласти

#КонецЕсли
