
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт

	//Команда отключена по требованию Павла Малыгина
	//
	//Команда = КомандыЗаполнения.Добавить();
	//Команда.Идентификатор = "НачислитьЗарплату";
	//Команда.Представление = "Заполнить";
	//Команда.Порядок = 10;
	//Команда.МножественныйВыбор = Ложь;
	//Команда.РежимЗаписи = "НеЗаписывать";
	//Команда.ВидимостьВФормах = "ФормаДокумента";
	//Команда.Обработчик = "ВызватьАвтоначисление";
	//Команда.ИмяФормы = "Форма.ФормаДокумента";

КонецПроцедуры

#КонецОбласти

#КонецЕсли
