
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт

    Команда = КомандыЗаполнения.Добавить();
    Команда.Идентификатор = "НачислитьЗарплату";
    Команда.Представление = "Начислить";
    Команда.Порядок = 10;
    Команда.МножественныйВыбор = Ложь;
    Команда.РежимЗаписи = "НеЗаписывать";
    Команда.ВидимостьВФормах = "ФормаДокумента";
    Команда.Обработчик = "ВызватьАвтоначисление";
    Команда.ИмяФормы = "Форма.ФормаДокумента";

КонецПроцедуры

#КонецОбласти

#КонецЕсли
