
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции
    
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
// Начало Володин А.А. 
// Дипломная работа
// 19 февраля 2025 г.

    Команда = КомандыЗаполнения.Добавить();
    Команда.Идентификатор = "ЗаполнитьРаботы";
    Команда.Представление = "Заполнить";
    Команда.Порядок = 10;
    Команда.МножественныйВыбор = Ложь;
    Команда.РежимЗаписи = "НеЗаписывать";
    Команда.ВидимостьВФормах = "ФормаДокумента";
    Команда.Обработчик = "ВКМ_ВызватьАвтозаполнение";
    Команда.ИмяФормы = "Форма.ФормаДокумента";
     
// Конец 19 февраля 2025 г.

КонецПроцедуры

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
// Начало Володин А.А. 
// Дипломная работа
// 21 февраля 2025 г.        
    НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
// Конец 21 февраля 2025 г.
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
// Начало Володин А.А. 
// Дипломная работа
// 21 февраля 2025 г.
    
    // Акт
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "Акт";
    КомандаПечати.Представление = НСтр("ru = 'Акт оказанных услуг'");
    КомандаПечати.Порядок = 5;
    
// Конец 21 февраля 2025 г.   
КонецПроцедуры

#КонецОбласти

#КонецЕсли