
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ВКМ_ВыполнитьАвтозаполнение(Ссылка) Экспорт

// Начало Володин А.А. 
// Дипломная работа
// 20 февраля 2025 г.

    ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	ДокументОбъект.Услуги.Очистить();
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВЫБОР
        |        КОГДА ВКМ_НоменклатураРаботыСпециалиста.Значение.Ссылка ЕСТЬ НЕ NULL
        |            ТОГДА ВКМ_НоменклатураРаботыСпециалиста.Значение
        |        ИНАЧЕ 0
        |    КОНЕЦ КАК НоменклатураРаботыСпециалиста,
        |    ВЫБОР
        |        КОГДА ВКМ_НоменклатураАбонентскаяПлата.Значение.Ссылка ЕСТЬ НЕ NULL
        |            ТОГДА ВКМ_НоменклатураАбонентскаяПлата.Значение
        |        ИНАЧЕ 0
        |    КОНЕЦ КАК НоменклатураАбонентскаяПлата
        |ПОМЕСТИТЬ ВТ_Константы
        |ИЗ
        |    Константа.ВКМ_НоменклатураАбонентскаяПлата КАК ВКМ_НоменклатураАбонентскаяПлата,
        |    Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты, 0) КАК СуммаАбонентскойПлаты,
        |    ВТ_Константы.НоменклатураАбонентскаяПлата КАК НоменклатураАбонентскаяПлата,
        |    ВТ_Константы.НоменклатураРаботыСпециалиста КАК НоменклатураРаботыСпециалиста,
        |    СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот) КАК КоличествоЧасов,
        |    СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплате
        |ИЗ
        |    РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ПериодНачало, &ПериодКонец,, Клиент = &Клиент) КАК
        |        ВКМ_ВыполненныеКлиентуРаботыОбороты
        |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |        ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = ДоговорыКонтрагентов.Ссылка,
        |    ВТ_Константы КАК ВТ_Константы
        |ГДЕ
        |    ДоговорыКонтрагентов.Ссылка = &Договор
        |СГРУППИРОВАТЬ ПО
        |    ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты, 0),
        |    ВТ_Константы.НоменклатураАбонентскаяПлата,
        |    ВТ_Константы.НоменклатураРаботыСпециалиста";
    
    Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ДокументОбъект.Дата));
    Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ДокументОбъект.Дата));
    Запрос.УстановитьПараметр("Клиент", ДокументОбъект.Контрагент);
    Запрос.УстановитьПараметр("Договор", ДокументОбъект.Договор);
    
    Если Запрос.Выполнить().Пустой() Тогда
        
        Сообщить("Ошибка! Запрос пустой. Обратитесь к администратору.", СтатусСообщения.Внимание);
        
        Возврат;
        
    КонецЕсли;
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
            
        Если Выборка.НоменклатураАбонентскаяПлата = 0 Или Выборка.НоменклатураРаботыСпециалиста = 0 Тогда
            
            ТекстСообщения = НСтр("ru = 'Проверьте заполнение значений констант ""Номенклатура абонентская плата"" и ""Номенклатура работы специалиста"".
                                        |Обе константы должны быть заполнены!'");
                
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , );
                
            Возврат;
            
        КонецЕсли;
                        
        //Выполним условие "Если в договоре ненулевая сумма абонентской платы, добавьте..."     
        Если ЗначениеЗаполнено(Выборка.СуммаАбонентскойПлаты) Тогда
        
            НоваяСтрокаУслуги = ДокументОбъект.Услуги.Добавить();
            НоваяСтрокаУслуги.Номенклатура = Выборка.НоменклатураАбонентскаяПлата;
            НоваяСтрокаУслуги.Количество = 1;
            НоваяСтрокаУслуги.Цена = Выборка.СуммаАбонентскойПлаты;
            НоваяСтрокаУслуги.Сумма = Выборка.СуммаАбонентскойПлаты * НоваяСтрокаУслуги.Количество;
                
        Иначе
                      
            ТекстСообщения = НСтр("ru = 'В договоре не указана сумма абонентской платы.'");
            
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , );
        
        КонецЕсли;
        
        //Выполним условие "Если ... есть информация о выполненных работах по этому договору"    
        Если ЗначениеЗаполнено(Выборка.КоличествоЧасов) Тогда
        
            НоваяСтрокаУслуги = ДокументОбъект.Услуги.Добавить();
            НоваяСтрокаУслуги.Номенклатура = Выборка.НоменклатураРаботыСпециалиста;
            НоваяСтрокаУслуги.Количество = Выборка.КоличествоЧасов;
            НоваяСтрокаУслуги.Цена = Выборка.СуммаКОплате / Выборка.КоличествоЧасов;
            НоваяСтрокаУслуги.Сумма = Выборка.СуммаКОплате;
            
        Иначе
        
            ТекстСообщения = НСтр("ru = 'В текущем месяце не было работ по договору.'");
                
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , );
            
        КонецЕсли;
    
    КонецЦикла;
    
    ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
    
// Конец 20 февраля 2025 г. 
   
КонецПроцедуры

#КонецОбласти

#КонецЕсли
