
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    СформироватьДвижения();
    
    РассчитатьНДФЛ();
    
    РассчитатьЗарплатуКВыплате();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()

    Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
	
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
  
КонецПроцедуры

Процедура РассчитатьНДФЛ()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ДополнительныеНачисления.Сотрудник,
        |    СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Результат
        |ИЗ
        |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
        |ГДЕ
        |    ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ДополнительныеНачисления.Сотрудник";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл

    	Движение = Движения.ВКМ_Удержания.Добавить();
    	Движение.ПериодРегистрации = Дата;
    	Движение.Сотрудник = Выборка.Сотрудник;
    	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
    	Движение.Результат = (Выборка.Результат * 13) / 100;
        
    КонецЦикла;
    
    Движения.ВКМ_Удержания.Записать();
    
КонецПроцедуры

Процедура РассчитатьЗарплатуКВыплате()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
        |    ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Результат
        |ПОМЕСТИТЬ ВТ_Начисления
        |ИЗ
        |    РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
        |ГДЕ
        |    ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |    ВКМ_ДополнительныеНачисления.Сотрудник,
        |    ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)
        |ИЗ
        |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
        |ГДЕ
        |    ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВТ_Начисления.Сотрудник КАК Сотрудник,
        |    СУММА(ВТ_Начисления.Результат) КАК Результат
        |ПОМЕСТИТЬ ВТ_Группировка
        |ИЗ
        |    ВТ_Начисления КАК ВТ_Начисления
        |СГРУППИРОВАТЬ ПО
        |    ВТ_Начисления.Сотрудник
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВТ_Группировка.Сотрудник КАК Сотрудник,
        |    ВТ_Группировка.Результат КАК Результат,
        |    СУММА(ВКМ_Удержания.Результат) КАК НДФЛ
        |ИЗ
        |    ВТ_Группировка КАК ВТ_Группировка
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
        |        ПО ВТ_Группировка.Сотрудник = ВКМ_Удержания.Сотрудник
        |ГДЕ
        |    ВКМ_Удержания.Регистратор = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВТ_Группировка.Сотрудник,
        |    ВТ_Группировка.Результат";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
      
    РезультатЗапроса = Запрос.Выполнить();
        
    Выборка = РезультатЗапроса.Выбрать();
        
    Пока Выборка.Следующий() Цикл
        
        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
        Движение.Сумма = Выборка.Результат - Выборка.НДФЛ;
        
    КонецЦикла;
    
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры  

#КонецОбласти

#КонецЕсли
