
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    СформироватьДвижения();
    
    РассчитатьНДФЛ();
    
    //РассчитатьЗарплатуКВыплате();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()

	// регистр ВКМ_ДополнительныеНачисления
	
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
	
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    //Данный фрагмент построен конструктором.
    //При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ    
    
КонецПроцедуры

Процедура РассчитатьНДФЛ()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ДополнительныеНачисления.Сотрудник,
        |    СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Результат
        |ИЗ
        |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
        |ГДЕ
        |    ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ДополнительныеНачисления.Сотрудник";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл

    	// регистр ВКМ_Удержания
    	Движения.ВКМ_Удержания.Записывать = Истина;
    	Движение = Движения.ВКМ_Удержания.Добавить();
    	Движение.Сторно = Ложь;
    	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
    	Движение.ПериодРегистрации = Дата;
    	Движение.Сотрудник = Выборка.Сотрудник;
    	Движение.Результат = Выборка.Результат * 0.87;
        
    КонецЦикла;
    
    Движения.ВКМ_Удержания.Записать();
    
КонецПроцедуры   

#КонецОбласти

#КонецЕсли
