#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтоАдресВременногоХранилища(Параметры.ДанныеДиаграммы) Тогда
        
        ДанныеДиаграммы = ПолучитьИзВременногоХранилища(Параметры.ДанныеДиаграммы); 
        
        ДиаграммаГанта.Обновление = Ложь;
        
        ДиаграммаГанта.Очистить();
        
        Для Каждого Сотрудник Из ДанныеДиаграммы Цикл
        
            ТекущаяСерия = ДиаграммаГанта.УстановитьСерию("Ежегодный отпуск");
            
            ТекущаяТочка = ДиаграммаГанта.УстановитьТочку(Сотрудник.Сотрудник);
            
            ТекущееЗначение = ДиаграммаГанта.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
                        
            ТекущийИнтервал = ТекущееЗначение.Добавить();
            ТекущийИнтервал.Начало = Сотрудник.ДатаНачала;
            ТекущийИнтервал.Конец = Сотрудник.ДатаОкончания;
                         
        КонецЦикла;
        
        ДиаграммаГанта.Обновление = Истина;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
