
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
    
    Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
    Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
    
    Набор.Прочитать();
    
    ЧислоСекундВСутках = 86400;
    
    ДатаСч = ДатаНачала;
    
    Для Сч = 0 По Набор.Количество()-1 Цикл
        
        Запись = Набор[Сч];
        
        Если Запись.Дата < ДатаСч Тогда
            
            Продолжить;
            
        ИначеЕсли Запись.Дата = ДатаСч Тогда
            
            Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаСч))) Тогда
                
                Запись.Значение = 0;
                
            Иначе
                
                Запись.Значение = 8;
                
            КонецЕсли;
            
            ДатаСч = ДатаСч + ЧислоСекундВСутках;
            
        Иначе
            
            Пока ДатаСч < Мин(Запись.Дата, ДатаОкончания) Цикл
                
                НоваяЗапись = Набор.Добавить();
                НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
                НоваяЗапись.Дата = ДатаСч;
                
                Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаСч))) Тогда
                    
                    НоваяЗапись.Значение = 0;
                    
                Иначе
                    
                    НоваяЗапись.Значение = 8;
                    
                КонецЕсли;
                
                ДатаСч = ДатаСч + ЧислоСекундВСутках;
                
            КонецЦикла;
            
            Если Запись.Дата > ДатаОкончания Тогда
                
                Прервать;
                
            Иначе
                
                Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаСч))) Тогда
                    
                    Запись.Значение = 0;
                    
                Иначе
                    
                    Запись.Значение = 8;
                    
                КонецЕсли;
                
            КонецЕсли;
            
            ДатаСч = ДатаСч + ЧислоСекундВСутках;
            
        КонецЕсли; 
        
    КонецЦикла;
    
    Набор.Записать();
    
    Пока ДатаСч <= ДатаОкончания Цикл
        
        Запись = Набор.Добавить();
        Запись.ГрафикРаботы = ГрафикРаботы;
        Запись.Дата = ДатаСч;
        
        Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаСч))) Тогда
            
            Запись.Значение = 0;
            
        Иначе
            
            Запись.Значение = 8;
            
        КонецЕсли;
        
        ДатаСч = ДатаСч + ЧислоСекундВСутках;
        
    КонецЦикла;
    
    Набор.Записать();
    
КонецПроцедуры


#КонецОбласти

#КонецЕсли
