
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ВКМ_УчетОтпусков.Записывать = Истина;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
        |    РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
        |        ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ) КАК СуммаДней
        |ИЗ
        |    Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |ГДЕ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
        |ИТОГИ
        |    СУММА(СуммаДней)
        |ПО
        |    Сотрудник";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
    ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
    
    ОтпускаСотрудников.Загрузить(ТаблицаЗначений);
        
    Выборка = Запрос.Выполнить().Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        Если Выборка.СуммаДней > 28 Тогда
            
            ТекстСообщения = НСтр("ru = 'У сотрудника %1 превышено количество дней отпуска.'");
       
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Выборка.СотрудникПредставление), , "Выплаты["+ Выборка.НомерСтроки +"].Сотрудник", "Объект", Отказ);
            
            Продолжить;
            
        КонецЕсли;
        
        Движение = Движения.ВКМ_УчетОтпусков.Добавить();
        Движение.Период = Дата;
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Значение = Выборка.СуммаДней;
       
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
