
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)) КАК СуммаДней
        |ПОМЕСТИТЬ ВТ_КоличествоДней
        |ИЗ
        |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |ГДЕ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
        |	ВТ_КоличествоДней.СуммаДней КАК СуммаДней
        |ИЗ
        |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоДней КАК ВТ_КоличествоДней
        |		ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = ВТ_КоличествоДней.Сотрудник
        |ГДЕ
        |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
    РезультатЗапроса = Запрос.Выполнить().Выгрузить();
     
    ОтпускаСотрудников.Загрузить(РезультатЗапроса);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти


#КонецЕсли
