
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ВКМ_УчетОтпусков.Записывать = Истина;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |    СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
        |        ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)) КАК СуммаДней
        |ПОМЕСТИТЬ ВТ_КоличествоДней
        |ИЗ
        |    Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |ГДЕ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
        |    ВТ_КоличествоДней.СуммаДней КАК СуммаДней
        |ИЗ
        |    Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоДней КАК ВТ_КоличествоДней
        |        ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = ВТ_КоличествоДней.Сотрудник
        |ГДЕ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
    ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
    
    МассивЗначений = ТаблицаЗначений.ВыгрузитьКолонку("СуммаДней");
    
    Для Инд = 0 По МассивЗначений.ВГраница() Цикл
        
        МассивЗначений[Инд] = МассивЗначений[Инд] + 1;
    
    КонецЦикла;
            
    ОтпускаСотрудников.ЗагрузитьКолонку(МассивЗначений, "СуммаДней");
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        Если Выборка.СуммаДней > 28 Тогда
            
            ТекстСообщения = НСтр("ru = 'Для сотрудника %1 запись в регистр не выполнена. Превышено количество дней отпуска.'");
       
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Выборка.Сотрудник));
            
            Продолжить;
            
        КонецЕсли;
        
        Движение = Движения.ВКМ_УчетОтпусков.Добавить();
        Движение.Период = Дата;
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Значение = Выборка.СуммаДней;
       
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
