#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
    ЭлементОформленияКрасный.Использование = Истина;
    ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Коралловый);
    
    ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.СуммаДней");
    ЭлементУсловияКрасный.ПравоеЗначение = 28; 
    ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловияКрасный.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
    ЭлементОформленияКрасный.Использование = Истина;
    ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Коралловый);
    
    ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.СуммаДней");
    ЭлементУсловияКрасный.ПравоеЗначение = 28; 
    ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловияКрасный.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
    
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
