#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСуммуДней();
	
    ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
    ЭлементОформленияКрасный.Использование = Истина;
    ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Коралловый);
    
    ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.СуммаДней");
    ЭлементУсловияКрасный.ПравоеЗначение = 28; 
    ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловияКрасный.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗаполнитьСуммуДней();
    
    ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
    ЭлементОформленияКрасный.Использование = Истина;
    ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Коралловый);
    
    ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.СуммаДней");
    ЭлементУсловияКрасный.ПравоеЗначение = 28; 
    ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловияКрасный.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
    
    Если Объект.ОтпускаСотрудников.Количество() > 0 Тогда
        
        ДанныеДиаграммы = ПоместитьВоВременноеХранилищеАнализГрафика();
        
        ПараметрыФормы = Новый Структура();
        ПараметрыФормы.Вставить("ДанныеДиаграммы", ДанныеДиаграммы);
    
        ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы);
        
    Иначе
            
        ТекстСообщения = НСтр("ru='В таблице Отпуска сотрудников нет данных для анализа.'");
        
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеАнализГрафика()
        
    ДанныеДиаграммы = Объект.ОтпускаСотрудников.Выгрузить();
        
    АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДанныеДиаграммы, УникальныйИдентификатор);
    
    Возврат АдресВременногоХранилища;
    
КонецФункции

&НаСервере
Процедура ЗаполнитьСуммуДней()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |    СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
        |        ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)) КАК СуммаДней
        |ПОМЕСТИТЬ ВТ_КоличествоДней
        |ИЗ
        |    Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |ГДЕ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
        |    ВТ_КоличествоДней.СуммаДней КАК СуммаДней
        |ИЗ
        |    Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоДней КАК ВТ_КоличествоДней
        |        ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = ВТ_КоличествоДней.Сотрудник
        |ГДЕ
        |    ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
        
    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
            
    ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
    
    Объект.ОтпускаСотрудников.Очистить();
    
    Объект.ОтпускаСотрудников.Загрузить(ТаблицаЗначений);
    
КонецПроцедуры

#КонецОбласти
