#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
    ЭлементОформленияКрасный.Использование = Истина;
    ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Коралловый);
    
    ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.СуммаДней");
    ЭлементУсловияКрасный.ПравоеЗначение = 28; 
    ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловияКрасный.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
    ЭлементОформленияКрасный.Использование = Истина;
    ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Коралловый);
    
    ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловияКрасный.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.СуммаДней");
    ЭлементУсловияКрасный.ПравоеЗначение = 28; 
    ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловияКрасный.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
    
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
    
    Если Объект.ОтпускаСотрудников.Количество() > 0 Тогда
        
        ДанныеДиаграммы = ПоместитьВоВременноеХранилищеАнализГрафика();
        
        ПараметрыФормы = Новый Структура();
        ПараметрыФормы.Вставить("ДанныеДиаграммы", ДанныеДиаграммы);
    
        ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы);
        
    Иначе
            
        ТекстСообщения = НСтр("ru='В таблице Отпуска сотрудников нет данных для анализа.'");
        
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
        
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеАнализГрафика()
        
    ДанныеДиаграммы = Объект.ОтпускаСотрудников.Выгрузить();
        
    АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДанныеДиаграммы, УникальныйИдентификатор);
    
    Возврат АдресВременногоХранилища;
    
КонецФункции

#КонецОбласти
