
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
    
    ЗаполнитьГрафикНаСервере();
    
    ТекстСообщения = НСтр("ru = 'График заполнен.'");
    
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(Период.ДатаНачала, Период.ДатаОкончания, Выходные);
    
КонецПроцедуры

#КонецОбласти
