
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ВызватьАвтозаполнение(Ссылка, Параметры) Экспорт
   
// Начало Володин А.А. 
// Дипломная работа
// 20 февраля 2025 г.

    Если Параметры.Форма.Объект.Услуги.Количество() > 0 Тогда //Необходимо упростить получение ТЧ, либо убрать проверку в целом.
        
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Ссылка", Ссылка);
		
		ОбработчикОповещения = Новый ОписаниеОповещения("ВКМ_ВызватьАвтозаполнениеПродолжить", Параметры.Форма, ДополнительныеПараметры);
        ТекстВопроса = НСтр("ru = 'Все введенные строки таблицы Услуги будут очищены. Продолжить?'");
        ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, "Подтвердите действие", КодВозвратаДиалога.Нет);
		
	Иначе
		
		ВКМ_ВызватьАвтозаполнениеНаСервере(Ссылка);

    КонецЕсли;
        
// Конец 20 февраля 2025 г.    
    
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ВызватьАвтозаполнениеПродолжить(КодВозврата, ДополнительныеПараметры) Экспорт
    
// Начало Володин А.А. 
// Дипломная работа
// 20 февраля 2025 г.

    Если КодВозврата = КодВозвратаДиалога.Да Тогда
        
        ВКМ_ВызватьАвтозаполнениеНаСервере(ДополнительныеПараметры.Ссылка);
                
    КонецЕсли;

// Конец 20 февраля 2025 г.    
    
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВызватьАвтозаполнениеНаСервере(Ссылка)
    
// Начало Володин А.А. 
// Дипломная работа
// 20 февраля 2025 г.
   
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
        |ИЗ
        |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |ГДЕ
        |	ДоговорыКонтрагентов.Ссылка = &Ссылка";
    
	Запрос.УстановитьПараметр("Ссылка", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор"));
    
    Выборка = Запрос.Выполнить().Выбрать();    
    
    Если Выборка.Следующий() Тогда
            
        ВидДоговора = Выборка.ВидДоговора;
    
    КонецЕсли;
        
    Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
        
        ДокументОбъект = РеквизитФормыВЗначение("Объект");
        ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение(Ссылка);     
        
    Иначе
        
        ТекстСообщения = НСтр("ru = 'Выберите договор с видом Абонентская плата.'");
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Договор", "Объект");

    КонецЕсли;

// Конец 20 февраля 2025 г.    
    
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
