
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    СформироватьДвижения();
    
    РассчитатьОклад();
    
    РассчитатьОтпуск();
    
    РассчитатьНДФЛ();
    
    РассчитатьЗарплатуКВыплате();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
    
    
    
	// регистр ВКМ_ОсновныеНачисления

	Для Каждого ТекСтрокаНачисления из Начисления Цикл
		
    		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
    		Движение.Сторно = Ложь;
    		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
    		Движение.ПериодРегистрации = Дата;
    		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаОкончания;
    		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
    		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
    		Движение.Категория = ТекСтрокаНачисления.Категория;
    		Движение.Результат = ТекСтрокаНачисления.Размер;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
    
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    //Данный фрагмент построен конструктором.
    //При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    
КонецПроцедуры

Процедура РассчитатьОклад()
    
    
КонецПроцедуры

Процедура РассчитатьОтпуск()
    
    
КонецПроцедуры

Процедура РассчитатьНДФЛ()
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
        |    СУММА(ВКМ_ОсновныеНачисления.Результат) КАК Результат
        |ИЗ
        |    РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
        |ГДЕ
        |    ВКМ_ОсновныеНачисления.Регистратор.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ОсновныеНачисления.Сотрудник
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |    ВКМ_ДополнительныеНачисления.Сотрудник,
        |    СУММА(ВКМ_ДополнительныеНачисления.Результат)
        |ИЗ
        |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
        |ГДЕ
        |    ВКМ_ДополнительныеНачисления.Регистратор.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    ВКМ_ДополнительныеНачисления.Сотрудник";
        
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
        
    РезультатЗапроса = Запрос.Выполнить();
        
    Выборка = РезультатЗапроса.Выбрать();
        
    Пока Выборка.Следующий() Цикл
            
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.ПериодРегистрации = Дата;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.Результат = Выборка.Результат * 0.87;
                    
    КонецЦикла;
    
    Движения.ВКМ_Удержания.Записать();
    
КонецПроцедуры

Процедура РассчитатьЗарплатуКВыплате()
    
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
