
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    СформироватьДвижения();
    
    РассчитатьПервичныеНачисления();
    
    РассчитатьДополнительныеНачисления();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
    
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |    ВКМ_НачислениеЗаработнойПлаты.Начисления.(
	    |        Сотрудник КАК Сотрудник,
	    |        Категория КАК Категория,
	    |        ВидРасчета КАК ВидРасчета,
	    |        ДатаНачала КАК ДатаНачала,
	    |        ДатаОкончания КАК ДатаОкончания,
	    |        Размер КАК Размер),
	    |    ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
	    |ИЗ
	    |    Документ.ВКМ_НачислениеЗаработнойПлаты КАК ВКМ_НачислениеЗаработнойПлаты
	    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	    |            ВКМ_УсловияОплатыСотрудниковСрезПоследних
	    |        ПО ВКМ_НачислениеЗаработнойПлаты.Начисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	    |ГДЕ
	    |    ВКМ_НачислениеЗаработнойПлаты.Ссылка = &Ссылка
	    |СГРУППИРОВАТЬ ПО
	    |    ВКМ_НачислениеЗаработнойПлаты.Начисления.(
	    |        Сотрудник,
	    |        Категория,
	    |        ВидРасчета,
	    |        ДатаНачала,
	    |        ДатаОкончания,
	    |        Размер)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сот);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    
	    // Вставить обработку выборки ВыборкаДетальныеЗаписи
	
	КонецЦикла;
    
	// регистр ВКМ_ОсновныеНачисления

	Для Каждого ТекСтрокаНачисления из Начисления Цикл
		
    		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
    		Движение.Сторно = Ложь;
    		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
    		Движение.ПериодРегистрации = Дата;
    		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаОкончания;
    		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
    		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
    		Движение.Категория = ТекСтрокаНачисления.Категория;
    		Движение.Результат = ТекСтрокаНачисления.Размер;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
    
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    //Данный фрагмент построен конструктором.
    //При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    
КонецПроцедуры

Процедура РассчитатьПервичныеНачисления()
    
    
КонецПроцедуры

Процедура РассчитатьДополнительныеНачисления()
    
    
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
