#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда
		
			НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Сумма абонентской платы";
			
	КонецЕсли;
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
        
            НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
            НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
            НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
            НовыйЭлемент.Заголовок = "Стоимость часа работы";
            
	КонецЕсли;
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;
	
    Если Элементы.Найти("НачалоДействияДоговора") = Неопределено Тогда
        
            НовыйЭлемент = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
            НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
            НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
            НовыйЭлемент.Заголовок = "Начало действия договора";
            
    КонецЕсли;
    
    Если Элементы.Найти("ОкончаниеДействияДоговора") = Неопределено Тогда
        
            НовыйЭлемент = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"));
            НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
            НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
            НовыйЭлемент.Заголовок = "Окончание действия договора";
            
    КонецЕсли;
    
    Элементы.ВидДоговора.УстановитьДействие("ПриИзменеини", "ВидДоговораПриИзменении");
	
    ВывестиЭлементыНаФорму(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
    
    ВывестиЭлементыНаФорму(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиЭлементыНаФорму(Форма)
    
    Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда

        Форма.Элементы.ВКМ_НачалоДействияДоговора = Истина;
        Форма.Элементы.ВКМ_ОкончаниеДействияДоговора = Истина;
        Форма.Элементы.ВКМ_СтоимостьЧасаРаботы = Истина;
        Форма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
        
    Иначе
        
        Форма.Элементы.ВКМ_НачалоДействияДоговора = Ложь;
        Форма.Элементы.ВКМ_ОкончаниеДействияДоговора = Ложь;
        Форма.Элементы.ВКМ_СтоимостьЧасаРаботы = Ложь;
        Форма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
        
    КонецЕсли;
 
КонецПроцедуры

#КонецОбласти