#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    Если ОбменДанными.Загрузка Тогда
        
        Возврат;
    
    КонецЕсли;
    
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ОбслуживаниеКлиента.Договор.Представление
        |ИЗ
        |    Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        |ГДЕ
        |    ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
        |    И ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = &ВидДоговора
        |    И
        |        ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_НачалоДействияДоговора <= &ДатаДокумента <= ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ОкончаниеДействияДоговора";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание"));
    Запрос.УстановитьПараметр("ДатаДокумента", Дата);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Не Выборка.Следующий() Тогда
                
        ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Проверьте правильность выбора договора:
                                                        |Должен быть выбран договор с типом Абонентская плата.
                                                        |Дата документа должна быть в пределах срока действия договора.'"),
                                                        , "Договор", "Объект", Отказ);
                                           
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
