#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    Если ОбменДанными.Загрузка Тогда
        
        Возврат;
    
    КонецЕсли;
    
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
        |    ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ОкончаниеДействияДоговора КАК ОкончаниеДействияДоговора
        |ИЗ
        |    Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        |ГДЕ
        |    ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
        |    И ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = &ВидДоговора
        |    И ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_НачалоДействияДоговора <= &ДатаДокумента
        |    И ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ОкончаниеДействияДоговора >= &ДатаДокумента";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
    Запрос.УстановитьПараметр("ДатаДокумента", Дата);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Если Не Выборка.Следующий() Тогда
        
        ТекстСообщения = НСтр("ru = 'Проверьте правильность выбора договора:
                                    |Должен быть выбран договор с типом Абонентское обслуживание.
                                    |Дата документа должна быть в пределах срока действия договора.'");
       
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Договор", "Объект", Отказ);
                                           
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
