
#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщение()

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВКМ_УведомленияТелеграмБоту.Ссылка,
        |    ВКМ_УведомленияТелеграмБоту.ТекстСообщения,
        |    ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК Chat_ID,
        |    ВКМ_ТокенУправленияТелеграмБотом.Значение КАК Token
        |ИЗ
        |    Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту,
        |    Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения,
        |    Константа.ВКМ_ТокенУправленияТелеграмБотом КАК ВКМ_ТокенУправленияТелеграмБотом";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        Token = Выборка.Token;
        Chat_ID = Выборка.Chat_ID;
        ТекстСообщения = Выборка.ТекстСообщения;
        
        АдресТелеграм = "api.telegram.org";
        
        Соединение = Новый HTTPСоединение(АдресТелеграм, 443, , , , Новый ЗащищенноеСоединениеOpenSSL());
        
        Данные = Новый Структура();
        Данные.Вставить("text", ТекстСообщения);
        Данные.Вставить("chat_id", Chat_ID);
        
        ЗаписьJSON = Новый ЗаписьJSON();
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, Данные);
        СтрокаJSON = ЗаписьJSON.Закрыть();
        
        Заголовки = Новый Соответствие();
        Заголовки.Вставить("Content-Type", "application/json");
        
        АдресЗапроса = "/bot" + Token + "/sendMessage";
        
        Запрос =Новый HTTPЗапрос(АдресЗапроса, Заголовки);
        Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
        
        Попытка
            
            Результат = Соединение.ОтправитьДляОбработки(Запрос);
            Объект = Выборка.Ссылка.ПолучитьОбъект();
            Объект.Удалить(); 
            
        Исключение
            
            ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка в Телеграм'"), УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        
        КонецПопытки;
        
        	Если Не Результат.КодСостояния = 200 Тогда

                ВызватьИсключение "Ошибка проверки связи с Телеграм";
            
            КонецЕсли;
        
        Возврат;

    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти