
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
// Начало Володин А.А. 
// Дипломная работа
// 24 февраля 2025 г.

    ДлительнаяОперация = ЗаполнитьНаСервере(Объект.ПериодДляУказанияМесяца);
    
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.Интервал = 1;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
    
    ОписаниеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗавершение", ЭтотОбъект);
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОЗавершении, ПараметрыОжидания);
    
// Конец 24 февраля 2025 г.     
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере(Период)
// Начало Володин А.А. 
// Дипломная работа
// 24 февраля 2025 г.

    ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРеализаций", Период);
    
    Возврат ДлительнаяОперация;
    
// Конец 24 февраля 2025 г. 
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
// Начало Володин А.А. 
// Дипломная работа
// 24 февраля 2025 г.

    Если Результат = Неопределено Тогда
        
        Возврат;
    
    КонецЕсли;
    
    Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));  //Здесь сообщается результат выполнения операции

// Конец 24 февраля 2025 г.     
КонецПроцедуры

#КонецОбласти
